In [1]:
import pandas as pd
import numpy as np

In [2]:
cou =pd.read_csv('courses.csv')
deli =pd.read_csv('deliveries.csv')
nov =pd.read_csv('reg-month1.csv')
dec =pd.read_csv('reg-month2.csv')
stu =pd.read_csv('students.csv')
match =pd.read_csv('matches.csv')

pd.concat
df.concat
ignore index
multindex
concat dataframes

In [3]:
Regi =pd.concat([nov,dec],axis=0)

In [4]:
Regi.tail(3)

    student_id  course_id
25          42          9
26          50          8
27          38          1

multiindex keys

In [5]:
multi =pd.concat((nov,dec),keys=['nov','dec'],axis=0)

In [41]:
multi.head(2)

       student_id  course_id
nov 0          23          1
    1          15          5

In [6]:
multi.loc[('nov',1)]

student_id    15
course_id      5
Name: (nov, 1), dtype: int64

In [7]:
multi.loc[('dec',0)]

student_id    3
course_id     5
Name: (dec, 0), dtype: int64


merging

INNER Join

In [18]:
stu.merge(multi,how='inner',on='student_id').tail(5)

    student_id             name  partner  course_id
45          23   Chhavi Lachman       18          9
46          23   Chhavi Lachman       18          5
47          24     Radhika Suri       17          4
48          25  Shashank D’Alia        2          1
49          25  Shashank D’Alia        2         10

find total revenu generated by company

In [38]:
total = multi.merge(cou,how='inner',on='course_id')['price']

In [39]:
total.tail(3)

50     699
51    1099
52    2499
Name: price, dtype: int64

In [40]:
total.sum()

np.int64(154247)

find month by month revenue

In [49]:
temp = pd.concat([nov,dec],keys=['nov','dec']).reset_index()

In [51]:
temp.tail(5)

   level_0  level_1  student_id  course_id
48     dec       23          14          1
49     dec       24          11         10
50     dec       25          42          9
51     dec       26          50          8
52     dec       27          38          1

In [53]:
temp.merge(cou,how="inner",on='course_id').groupby('level_0')['price'].sum()

level_0
dec    65072
nov    89175
Name: price, dtype: int64